[
  {
    "level": "Начинающий",
    "sublevels": [
      {
        "title": "Основные настройки камеры",
        "tasks": [
          {
            "taskNumber": 1,
            "description": "Сделайте фото, демонстрирующее ваше понимание основных настроек камеры.",
            "maxPhotos": 5
          }
        ],
        "lessons": [
          {
            "lessonNumber": 1,
            "title": "Диафрагма ",
            "content": "Диафрагма является одним из важнейших параметров, влияющих на экспозицию и глубину резкости изображения. Этот урок охватывает основные понятия, техники и практические советы по использованию диафрагмы.\n\n### Основные понятия\nДиафрагма — это отверстие в объективе камеры, через которое проходит свет. Размер диафрагмы регулируется числовым значением, называемым f-числом или f-стопом. Маленькое f-число (например, f/1.8) означает большую диафрагму, пропускающую больше света, тогда как большое f-число (например, f/16) означает меньшую диафрагму, пропускающую меньше света.\n\n### Влияние на экспозицию\nДиафрагма является одним из трех параметров, которые влияют на экспозицию, наряду с выдержкой и ISO. Большая диафрагма (малое f-число) позволяет пропускать больше света, что полезно при съемке в условиях низкой освещенности. Малая диафрагма (большое f-число) уменьшает количество света, что полезно при съемке в ярком освещении.\n\n### Влияние на глубину резкости\nДиафрагма также влияет на глубину резкости — область изображения, которая выглядит резкой. Большая диафрагма (малое f-число) создает малую глубину резкости, что позволяет выделить объект на фоне размытого фона (боке). Малая диафрагма (большое f-число) увеличивает глубину резкости, делая как передний, так и задний план более резкими.\n\n### Практические советы\n1. **Портретная съемка**: Используйте большую диафрагму (например, f/1.8 или f/2.8) для создания малой глубины резкости и выделения объекта на фоне размытого фона.\n2. **Пейзажная съемка**: Используйте малую диафрагму (например, f/11 или f/16) для достижения большой глубины резкости и обеспечения резкости как переднего, так и заднего плана.\n3. **Съемка при слабом освещении**: Используйте большую диафрагму, чтобы пропускать больше света и уменьшить необходимость в повышении ISO, что может привести к шуму на изображении.\n\n### Упражнения\n1. **Изучение влияния диафрагмы на глубину резкости**: Выберите объект и снимите его с разными значениями диафрагмы (например, f/1.8, f/4, f/8, f/16). Обратите внимание, как изменяется глубина резкости на каждом снимке.\n2. **Эксперименты с экспозицией**: Снимайте одну и ту же сцену с разными значениями диафрагмы и настройками выдержки/ISO, чтобы понять, как они взаимодействуют для создания правильной экспозиции.",
            "examples": [
              {
                "description": "Пример фото с широкой диафрагмой (f/1.8)",
                "imageUrl": "example-wide-aperture.jpg"
              },
              {
                "description": "Пример фото с узкой диафрагмой (f/16)",
                "imageUrl": "example-narrow-aperture.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте два портрета: один с широкой диафрагмой для размытия фона, другой с узкой для четкости всего кадра.",
                "maxPhotos": 2
              },
              {
                "taskNumber": 2,
                "description": "Сфотографируйте пейзаж с разными значениями диафрагмы и сравните, как меняется глубина резкости.",
                "maxPhotos": 3
              }
            ]
          },

          {
            "lessonNumber": 2,
            "title": "Выдержка ",
            "content": "Выдержка  - это время, в течение которого затвор камеры остается открытым, пропуская свет на матрицу. Измеряется в секундах или долях секунды (например, 1/1000, 1/60). Короткая выдержка позволяет 'заморозить' движение, длинная - создать эффект размытия движущихся объектов.",
            "examples": [
              {
                "description": "Пример фото с короткой выдержкой (1/100 с)",
                "imageUrl": "https://utfs.io/f/54959a73-764a-47f3-8890-2c801fa1926a-tmclbb.jpg"
              },
              {
                "description": "Пример фото с длинной выдержкой (1/50 с)",
                "imageUrl": "https://utfs.io/f/64646b0e-1afe-4270-9fa2-190b825855fb-tmclbc.jpg"
              },
              {
                "description": "Пример фото с короткой выдержкой (1/25 с)",
                "imageUrl": "https://utfs.io/f/67dffe60-ef2d-46b7-a451-e1c6d70bcf9d-tmclbd.jpg"
              },
              {
                "description": "Пример фото с длинной выдержкой (1 с)",
                "imageUrl": "https://utfs.io/f/de4fa258-72c2-4b9a-bd8b-dc8afb4c37ae-tmclbe.jpg"
              },
              {
                "description": "Пример фото с короткой выдержкой (5 с)",
                "imageUrl": "https://utfs.io/f/21d4213c-f270-4b88-8e6c-de28c2a1490e-tmclbf.jpg"
              },
              {
                "description": "Пример фото с длинной выдержкой (10 с)",
                "imageUrl": "https://utfs.io/f/6cb43644-80d6-40dd-82ea-4ff32982018d-tmclbg.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сфотографируйте движущийся объект (например, машину) с короткой выдержкой, чтобы 'заморозить' движение.",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Используйте длинную выдержку для съемки водопада или потока воды, чтобы создать эффект шелковистости.",
                "maxPhotos": 1
              }
            ]
          },

          {
            "lessonNumber": 3,
            "title": "ISO",
            "content": "ISO - это уровень чувствительности матрицы камеры к свету. Низкие значения ISO (например, 100, 200) дают менее чувствительную матрицу и меньше шума, но требуют больше света. Высокие значения ISO (например, 1600, 3200) увеличивают чувствительность, позволяя снимать в условиях низкой освещенности, но могут привести к появлению шума на изображении.",
            "examples": [
              {
                "description": "Пример фото с низким ISO (100)",
                "imageUrl": "example-low-iso.jpg"
              },
              {
                "description": "Пример фото с высоким ISO (3200)",
                "imageUrl": "example-high-iso.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте серию снимков одной и той же сцены с разными значениями ISO (100, 400, 1600, 3200) и сравните качество изображения и уровень шума.",
                "maxPhotos": 4
              },
              {
                "taskNumber": 2,
                "description": "Снимите сцену в условиях низкой освещенности, используя высокое значение ISO, чтобы получить правильно экспонированный кадр.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 4,
            "title": "Баланс белого ",
            "content": "Баланс белого - это настройка, которая позволяет передавать цвета на фотографии максимально приближенно к тому, как их видит человеческий глаз, независимо от типа освещения. Измеряется в градусах Кельвина (K). Различные источники света имеют разную цветовую температуру: от теплых тонов (свеча, закат) до холодных (ясное небо, тень).",
            "examples": [
              {
                "description": "Пример фото с теплым балансом белого (3000K)",
                "imageUrl": "example-warm-wb.jpg"
              },
              {
                "description": "Пример фото с холодным балансом белого (7000K)",
                "imageUrl": "example-cool-wb.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сфотографируйте белый объект при разных источниках света (дневной свет, лампа накаливания, флуоресцентная лампа), используя автоматический баланс белого и ручную настройку. Сравните результаты.",
                "maxPhotos": 6
              },
              {
                "taskNumber": 2,
                "description": "Создайте серию портретов при одном источнике света, но с разными настройками баланса белого. Оцените, как это влияет на цвет кожи и общее настроение снимка.",
                "maxPhotos": 3
              }
            ]
          }
        ]
      },

      {
        "title": "Композиция",
        "tasks": [
          {
            "taskNumber": 1,
            "description": "Сделайте фото, демонстрирующее ваше понимание композиции.",
            "maxPhotos": 5
          }
        ],
        "lessons": [
          {
            "lessonNumber": 1,
            "title": "Правило третей ",
            "content": "Правило третей - это основной принцип композиции, согласно которому кадр делится на девять равных частей двумя горизонтальными и двумя вертикальными линиями. Ключевые элементы изображения располагаются вдоль этих линий или на их пересечении. Это создает более сбалансированную и интересную композицию, чем простое размещение объекта в центре кадра.",
            "examples": [
              {
                "description": "Пример пейзажа с использованием правила третей",
                "imageUrl": "example-rule-of-thirds-landscape.jpg"
              },
              {
                "description": "Пример портрета с использованием правила третей",
                "imageUrl": "example-rule-of-thirds-portrait.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сфотографируйте пейзаж, расположив линию горизонта на нижней или верхней трети кадра.",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Сделайте портрет, поместив глаза модели на верхнюю линию третей.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 2,
            "title": "Ведущие линии ",
            "content": "Ведущие линии - это визуальные элементы в кадре, которые направляют взгляд зрителя к ключевым точкам изображения. Это могут быть дороги, реки, заборы, тени или любые другие линейные объекты. Использование ведущих линий помогает создать глубину и движение в фотографии.",
            "examples": [
              {
                "description": "Пример фото с использованием дороги как ведущей линии",
                "imageUrl": "example-leading-lines-road.jpg"
              },
              {
                "description": "Пример архитектурного фото с ведущими линиями",
                "imageUrl": "example-leading-lines-architecture.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Найдите и сфотографируйте природный объект (например, реку или дерево), который создает ведущую линию к интересному элементу на заднем плане.",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Сделайте городской снимок, используя архитектурные элементы как ведущие линии.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 3,
            "title": "Симметрия и паттерны ",
            "content": "Симметрия в фотографии создается, когда элементы с обеих сторон изображения зеркально отражают друг друга. Паттерны - это повторяющиеся элементы, которые создают визуальный ритм. Оба этих приема могут сделать фотографию более привлекательной и гармоничной.",
            "examples": [
              {
                "description": "Пример симметричной архитектурной фотографии",
                "imageUrl": "example-symmetry-architecture.jpg"
              },
              {
                "description": "Пример фото с природным паттерном",
                "imageUrl": "example-pattern-nature.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Найдите и сфотографируйте симметричный объект или сцену в природе или архитектуре.",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Сделайте снимок, в котором основным элементом композиции является повторяющийся паттерн.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 4,
            "title": "Обрамление ",
            "content": "Обрамление - это техника, при которой используются элементы сцены для создания естественной рамки вокруг основного объекта фотографии. Это может быть арка, ветви деревьев, окно или любой другой объект, окружающий главный элемент снимка. Обрамление помогает направить внимание зрителя и добавить глубину изображению.",
            "examples": [
              {
                "description": "Пример фото с использованием арки для обрамления",
                "imageUrl": "example-framing-arch.jpg"
              },
              {
                "description": "Пример природного обрамления с помощью ветвей",
                "imageUrl": "example-framing-branches.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сфотографируйте пейзаж или архитектурный объект, используя естественное обрамление (например, ветви деревьев или дверной проем).",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Создайте портрет, используя элементы окружения для обрамления лица модели.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 5,
            "title": "Фон",
            "content": "Фон играет crucial роль в композиции фотографии. Он может дополнять основной объект, создавать контраст или отвлекать внимание. Важно уделять внимание фону при построении композиции, чтобы он усиливал, а не ослаблял воздействие главного объекта.",
            "examples": [
              {
                "description": "Пример портрета с размытым фоном",
                "imageUrl": "example-background-blur.jpg"
              },
              {
                "description": "Пример фото с контрастным фоном",
                "imageUrl": "example-background-contrast.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте портрет с максимально размытым фоном, используя широкую диафрагму.",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Сфотографируйте объект на контрастном фоне, чтобы он выделялся.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 6,
            "title": "Спираль Фибоначчи",
            "content": "Спираль Фибоначчи, также известная как золотая спираль, - это композиционный прием, основанный на математическом соотношении. Она создает естественный и приятный глазу баланс в изображении. Размещение ключевых элементов вдоль спирали или в ее центре может создать гармоничную и динамичную композицию.",
            "examples": [
              {
                "description": "Пример фото природы с использованием спирали Фибоначчи",
                "imageUrl": "example-fibonacci-nature.jpg"
              },
              {
                "description": "Пример архитектурного фото со спиралью Фибоначчи",
                "imageUrl": "example-fibonacci-architecture.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Найдите в природе объект, форма которого напоминает спираль Фибоначчи (например, раковина улитки), и сфотографируйте его.",
                "maxPhotos": 1
              },
              {
                "taskNumber": 2,
                "description": "Создайте композицию, расположив элементы кадра в соответствии со спиралью Фибоначчи. Это может быть натюрморт или пейзаж.",
                "maxPhotos": 1
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "level": "Средний",
    "sublevels": [
      {
        "title": "Техники фокусировки",
        "tasks": [
          {
            "taskNumber": 1,
            "description": "Сделайте фото, демонстрирующее ваше понимание техник фокусировки.",
            "maxPhotos": 5
          }
        ],
        "lessons": [
          {
            "lessonNumber": 1,
            "title": "Ручная фокусировка vs Автофокус",
            "content": "Ручная фокусировка позволяет вам полностью контролировать, на что именно будет направлен фокус на изображении. Это особенно полезно при съемке в условиях низкой освещенности или когда автофокус не справляется. Автофокус использует сенсоры камеры для быстрой и точной фокусировки на объекте. Существует несколько режимов автофокуса, включая точечный автофокус, следящий автофокус и др. \n\n**Инструкция:** Для ручной фокусировки, переведите объектив в режим MF и вращайте кольцо фокусировки до тех пор, пока изображение не станет четким. Для автофокуса, выберите подходящий режим (например, точечный для статичных объектов или следящий для движущихся) и наполовину нажмите кнопку спуска затвора, чтобы камера сфокусировалась.",
            "examples": [
              {
                "description": "Пример фото с использованием ручной фокусировки",
                "imageUrl": "example-manual-focus.jpg"
              },
              {
                "description": "Пример фото с использованием автофокуса",
                "imageUrl": "example-auto-focus.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте два фото одного и того же объекта: одно с ручной фокусировкой, другое с автофокусом. Сравните результаты.",
                "maxPhotos": 2
              },
              {
                "taskNumber": 2,
                "description": "Снимите движущийся объект, используя следящий автофокус, чтобы показать, как камера поддерживает фокусировку на объекте.",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 2,
            "title": "Режимы фокусировки и точки фокусировки",
            "content": "Камеры обычно предлагают несколько режимов фокусировки, таких как одиночный автофокус (AF-S/One-Shot AF), следящий автофокус (AF-C/AI Servo AF) и автоматический автофокус (AF-A/AI Focus AF). Точки фокусировки позволяют выбирать, на какой части кадра камера будет фокусироваться. Они могут быть центральными, боковыми или распределенными по всему кадру. \n\n**Инструкция:** Для выбора режима фокусировки перейдите в меню камеры и выберите подходящий режим в зависимости от ситуации. Для выбора точки фокусировки используйте джойстик или сенсорный экран, чтобы выбрать нужную точку на экране видоискателя или дисплея.",
            "examples": [
              {
                "description": "Пример фото с центральной точкой фокусировки",
                "imageUrl": "example-central-focus-point.jpg"
              },
              {
                "description": "Пример фото с боковой точкой фокусировки",
                "imageUrl": "example-side-focus-point.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте три фотографии с использованием разных точек фокусировки: центральной, боковой и верхней. Оцените, как изменение точки фокусировки влияет на композицию и резкость изображения.",
                "maxPhotos": 3
              },
              {
                "taskNumber": 2,
                "description": "Используйте следящий автофокус для съемки движущегося объекта и попробуйте сохранить фокусировку на объекте на протяжении всей съемки.",
                "maxPhotos": 2
              }
            ]
          }
        ]
      },
      {
        "title": "Движение в фотографии",
        "tasks": [
          {
            "taskNumber": 1,
            "description": "Сделайте фото, демонстрирующее ваше понимание съемки движения.",
            "maxPhotos": 5
          }
        ],
        "lessons": [
          {
            "lessonNumber": 1,
            "title": "Замораживание движения",
            "content": "Чтобы заморозить движение, используйте короткую выдержку. Это позволит 'заморозить' объект в движении и получить четкое изображение. Короткие выдержки полезны для съемки быстро движущихся объектов, таких как спорт или дикая природа. \n\n**Инструкция:** Установите камеру в режим приоритета выдержки (S или Tv) и выберите короткую выдержку (например, 1/1000 секунды). Убедитесь, что освещение достаточно, чтобы избежать недоэкспонированных снимков.",
            "examples": [
              {
                "description": "Пример фото с замороженным движением",
                "imageUrl": "example-frozen-motion.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте фото быстро движущегося объекта, используя короткую выдержку, чтобы заморозить движение.",
                "maxPhotos": 2
              }
            ]
          },
          {
            "lessonNumber": 2,
            "title": "Размытие движения",
            "content": "Чтобы передать ощущение движения, используйте длинную выдержку. Это позволит запечатлеть траекторию движения объекта, создавая эффект размытия. Этот прием часто используется для съемки водопадов, автомобильных фар в ночное время или людей в движении. \n\n**Инструкция:** Установите камеру в режим приоритета выдержки (S или Tv) и выберите длинную выдержку (например, 1/30 секунды или длиннее). Используйте штатив, чтобы избежать смазывания всей сцены, и снимайте объекты, которые движутся относительно фона.",
            "examples": [
              {
                "description": "Пример фото с размытым движением",
                "imageUrl": "example-motion-blur.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "Сделайте фото движущегося объекта с длинной выдержкой, чтобы запечатлеть размытие движения.",
                "maxPhotos": 2
              }
            ]
          }
        ]
      }
    ]
  },

  {
    "level": "Продвинутый",
    "sublevels": [
      {
        "title": "Свет",
        "tasks": [
          {
            "taskNumber": 1,
            "description": "",
            "maxPhotos": 1
          }
        ],
        "lessons": [
          {
            "lessonNumber": 1,
            "title": "Естественное освещение",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-manual-focus.jpg"
              },
              {
                "description": "",
                "imageUrl": "example-auto-focus.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 2
              },
              {
                "taskNumber": 2,
                "description": "",
                "maxPhotos": 1
              }
            ]
          },
          {
            "lessonNumber": 2,
            "title": "Искусственное освещение",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-central-focus-point.jpg"
              },
              {
                "description": "",
                "imageUrl": "example-side-focus-point.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 3
              },
              {
                "taskNumber": 2,
                "description": "",
                "maxPhotos": 2
              }
            ]
          },
          {
            "lessonNumber": 3,
            "title": "Направление света",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-frozen-motion.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 2
              }
            ]
          },
          {
            "lessonNumber": 4,
            "title": "Световые модификаторы",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-motion-blur.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 2
              }
            ]
          }
        ]
      },
      {
        "title": "Теория цвета",
        "tasks": [
          {
            "taskNumber": 1,
            "description": "",
            "maxPhotos": 5
          }
        ],
        "lessons": [
          {
            "lessonNumber": 1,
            "title": "Насыщенность, контраст, плотность.",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-frozen-motion.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 2
              }
            ]
          },
          {
            "lessonNumber": 2,
            "title": "Цветовой круг, сочетание цветов",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-motion-blur.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 2
              }
            ]
          },
          {
            "lessonNumber": 3,
            "title": "Цветовая температура ",
            "content": "",
            "examples": [
              {
                "description": "",
                "imageUrl": "example-frozen-motion.jpg"
              }
            ],
            "tasks": [
              {
                "taskNumber": 1,
                "description": "",
                "maxPhotos": 2
              }
            ]
          }
        ]
      }
    ]
  }
]
